package memo;

public class memo {
	
}
/*
object : 객체
oriented : 향하다
programing : 프로그래밍

객체 : 독립적으로 각각 구분해서 인식 할 수 있는 모든 것
- 물건,물체,요소,대상
ex)키보드,김치,옆집아저씨,나,미세먼지,모래 한알, 판소리 무형문화제

지향 : 어떤것을 목표로함
객체 지향 -> 독립적으로 각각 구분해서 인식 할 수 있게끔 하는것을 목표로함

---------------------

현실에서 객체란 ?
모니터 : 크기 ,무게, 화소, 주사율 ,버튼...
-화면을 보여준다, 밝기를 조절한다, 주사율 조절..

속성 : 명사 -> 이름 나이 생년원일 키 몸무게 시력 주민번호
기능 : 동사 -> 밥을먹는다,걷는다,잠잔다,출근한다,퇴근한다

------------------------------
클래스

스마트폰
-크기, 무게 화소 카메라 ... 등등의 속성
-통화 게임 영상보기 사진찍기 기능

나중에 new 연산자를 통해 설계도를 따라 실제 사용될 수 있는 객체를 하나 만드는 것
























*/