package memo;

public class OOPMiddleTest {

	
	
/*
 *  현실 객체 : 자신의 속성(값,data)과 기능(동작,행동)이 다른 것들과 구분되어 식별 가능한 것 
	객체 지향 언어 : 각각의 객체로 이루어져 있으며, 발생하는 모든 사건들은 객체간의 상호작용
	자바 객체 : 클래스에 정의된 내용대로 new 연산자를 통해 메모리 영역에 생성
	class : 빵틀 같은거, 청사진
	new 연산자 : 빵
	추상화 : 공통의 성질을 묶고, 불필요한 것들을 제거
	캡슐화 : 하나로 묶고 보호해줌 1. 접근제어 2. 속성들을 하나로 묶음
	캡슐화 원칙 : 1.private을 쓰고 getter,setter로 접근
	메서드/기능의 '정의'란 : 함수 비스무레한거 값을받고 값을 반환 혹은 기능수행
	메서드의 '호출' 이란 : 함수를 직접적으로 사용하는거
	return : 
	
	
	
	
	
	public String ex1() {
	    return "Hi";
	}
	
	위 메서드 상세히 해석 : 
	1. 퍼블릭으로 접근가능 ( 같은 클래스 내에서 어디서든 접근 가능)
	2. 문자형으로 반환해줌
	3. ex1이라는 메서드명
	4. 반환값으로 "Hi"라는 문자열을 가짐

 * 
 * 
 * 
 * 
 * 
 * 
 */
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
